<template>
  <div class="box">
    <mt-header title="用户协议" class="header">
      <mt-button icon="back" slot="left" @click="back"></mt-button>
    </mt-header>
    <mt-navbar v-model="selected">
      <mt-tab-item id="1">用户服务协议</mt-tab-item>
      <mt-tab-item id="2">隐私政策</mt-tab-item>
    </mt-navbar>
    <!-- tab-container -->
    <mt-tab-container v-model="selected">
      <mt-tab-container-item id="1">
        <div class="agreement-tip">
          <p>欢迎使用如来云Wi-Fi服务</p>
        </div>
        <div v-for="(item) in services">
          <h5>{{item.title}}</h5>
          <p v-for="paragraph in item.paragraphs">
            {{paragraph}}
          </p>
        </div>
      </mt-tab-container-item>
      <mt-tab-container-item id="2">
        <div class="agreement-tip">
          <p>德纵科技非常重视您的隐私。为向您提供有关服务，您在使用我们的服务时，我们可能会收集和使用您的相关信息，在此我们通过本《隐私政策》向您说明，我们如何收集、使用和储存这些信息。
            本《隐私政策》与您所使用的德纵科技所提供的如来云WiFi服务息息相关，希望您仔细阅读。
            您使用或继续使用我们的服务，即意味着同意我们按照本《隐私政策》收集、使用、储存您的相关信息。</p>
        </div>
        <div v-for="(item) in privacy">
          <h5>{{item.title}}</h5>
          <p v-for="paragraph in item.paragraphs">
            {{paragraph}}
          </p>
        </div>
      </mt-tab-container-item>
    </mt-tab-container>
  </div>
</template>

<script>
  export default {
    name: "agreement",
    data: function () {
      return {
        selected: '1',
        services: [
          {
            title: '一、【特别提示】',
            paragraphs: [
              "1.1 为使用如来云WiFi服务，您应当阅读并遵守《用户服务协议》。请您务必审慎阅读、充分理解各条款内容，特别是免除或者限制责任的条款、管辖与法律适用条款，以及开通或使用某项服务的单独协议。限制、免责条款可能以黑体加粗形式提示您重点注意。除非您已阅读并接受本协议所有条款，否则您无权使用如来云WiFi服务。您使用如来云WiFi的服务即视为您已阅读并同意上述协议的约束。",
              "如果您未满18周岁，请在法定监护人的陪同下阅读本协议，并特别注意未成年人使用条款。",
              "1.2 本协议是您与德纵科技之间关于用户下载、安装、注册并登陆使用“如来云WiFi软件；使用、管理“如来云WiFi”账号以及德纵科技其他相关服务所订立的协议。“德纵科技”是指安徽德纵信息技术有限公司及如来云WiFi相关服务可能存在的运营关联单位等；“用户”是指使用如来云WiFi相关服务的使用人，在本协议中称为“您”或“用户”。",
              "1.3 本协议内容同时包括《隐私政策》,您在使用如来云WiFi某一特定服务时，该服务可能会另有单独的协议、相关业务规则等（以下统称为“单独协议”）。上述内容一经正式发布，即为本协议不可分割的组成部分，您同样应当遵守。您对前述任何业务规则、单独协议的接受，即视为您对本协议的接受。"
            ]
          },
          {
            title: '二、【服务内容】',
            paragraphs: [
              "2.1 德纵科技同意按照本协议的规定及不时发布的操作规则提供基于互联网的相关服务，为获得该服务，用户应当同意本协议的全部条款并按照页面上的提示完成全部的注册程序。除非用户已阅读并接受本协议所有条款，否则用户无权下载、安装或使用如来云WiFi APP及相关服务。用户下载、安装、注册、登陆等行为视为用户已阅读并同意该协议。",
              "2.2 如来云WiFi服务的具体内容由德纵科技根据实际情况提供，包括但不限于软件、多媒体、网络媒体、互联网增值、互动娱乐、电子商务和广告等产品及服务。\n" +
              "德纵科技保留变更、中断或终止部分或全部网络服务的权利。\n",
              "2.3 德纵科技向用户提供免费或付费的如来云WiFi网络服务，以及相关网络服务有关的设备（调制解调器及与接入互联网有关的装置，但不包括终端设备）。",
            ]
          },
          {
            title: '三、【使用规则】',
            paragraphs: [
              "3.1 用户在申请使用如来云WiFi服务时，必须向德纵科技提供准确的个人认证资料。根据国家法律规定，您需要填写真实的身份信息。如您填写的信息不完整，或未及时更正认证资料，您将可能无法使用本服务或在使用过程中受到限制。",
              "3.2 您应保证提供给德纵科技的资料均为真实无误的，该资料对于使用德纵科技的服务及找回丢失的所处场所WiFi账号至关重要。如因您提供虚假资料或被他人获悉自己的注册资料，从而导致的损失由您本人承担，损失包括但不限于因资料虚假而无法取回您丢失的所处场所WiFi账号。",
              "3.3 您在使用本服务的过程中需要下载软件，对于该软件，德纵科技给予您一项个人的、不可转让及非排他性的许可。您仅可为访问或使用本服务的目的而使用软件。",
              "3.4 为了改善用户体验、保证服务的安全性及产品功能的一致性，德纵科技可能会对软件进行更新。您应该将相关软件更新到最新版本，否则德纵科技并不保证其能正常使用。",
              "3.5 德纵科技可能为不同的终端设备开发不同的软件版本，您应当根据实际情况选择下载合适的版本进行安装，您可以从得到德纵科技授权的第三方获取这些软件。如果您从未经德纵科技授权的第三方获取软件或与软件名称相同的安装程序，德纵科技无法保证该软件能够正常使用，并对因此给您造成的损失不予负责。",
              "3.6 用户注册成功后，德纵科技将给予每个用户一个使用所处场所WiFi网络的账号（下称“所处场所WiFi账号”或“账号”），用户应当对其以所处场所WiFi账号进行的所有活动负法律责任。",
              "3.7 用户同意接受德纵科技在提供网络服务时在网络页面向用户发送商品促销或其他相关商业信息。",
              "3.8 用户在使用德纵科技网络服务过程中，必须遵循以下原则：",
              "(1) 遵守中国有关的法律和法规；",
              "(2) 不得为任何非法目的而使用网络服务系统；",
              "(3) 遵守所有与网络服务有关的网络协议、规定和程序；",
              "(4) 不得利用网络服务系统进行任何可能对互联网的正常运转造成不利影响的行为；",
              "(5) 不得利用网络服务系统传输任何骚扰性的、中伤他人的、辱骂性的、恐吓性的、庸俗淫秽的或其他任何非法的信息资料；",
              "(6) 不得利用网络服务系统进行任何不利于德纵科技的行为；",
              "(7) 仅为用户个人非商业性质的使用网络服务。",
              "3.9 如用户在使用网络服务时违反任何上述规定，德纵科技及/或其授权的人有权要求用户改正或直接采取一切必要的措施（包括但不限于更改或删除用户张贴的内容等、暂停或终止用户使用网络服务的权利）以减轻用户不当行为造成的影响。",
              "3.10 如果您违反了本条约定，相关国家机关或机构可能会对您提起诉讼、罚款或采取其他制裁措施，并要求德纵科技给予协助。造成损害的，您应依法予以赔偿，德纵科技不承担任何责任。",
              "3.11 如果德纵科技发现或收到他人举报您发布的信息违反本条约定，德纵科技有权独立判断并采取技术手段予以删除、屏蔽或断开链接。同时，德纵科技有权视用户的行为性质，采取包括但不限于暂停或终止服务，追究法律责任等措施。",
            ]
          },
          {
            title: '四、【所处场所WiFi账号管理】',
            paragraphs: [
              "4.1 用户可以通过注册所处场所WiFi账号使用德纵科技提供的各种服务，但账号的所有权归德纵科技，用户注册完成后，获得所处场所WiFi账号的使用权。",
              "4.2 所处场所WiFi账号使用权仅属于初始申请注册人，禁止赠与、借用、租用、转让或售卖。如果德纵科技发现使用者并非账号初始注册人，有权在未经通知的情况下回收该账号而无需向该账号使用人承担法律责任，由此带来的包括并不限于用户通讯中断、用户资料和游戏道具等清空等损失由用户自行承担。德纵科技禁止用户私下有偿或无偿转让账号，以免因账号问题产生纠纷，用户应当自行承担因违反此要求而遭致的任何损失，同时德纵科技保留追究上述行为人法律责任的权利。",
              "4.3 所处场所WiFi账号与密码的保管责任由用户自行承担，如发现他人未经许可使用其账号时应立即通知德纵科技。",
              "4.4 用户在丢失或遗忘所处场所WiFi帐号密码后，须遵照德纵科技公布的申诉途径及时申诉请求找回账号。用户应不断提供能增加账号安全性的个人密码保护资料。用户可以凭初始注册资料及个人密码保护资料填写申诉单向德纵科技申请找回账号，德纵科技的密码找回机制仅负责识别申诉单上所填资料与系统记录资料的正确性，而无法识别申诉人是否是真正账号使用权人。对用户因被他人冒名申诉而致的任何损失，德纵科技不承担任何责任，德纵科技并不承诺账号丢失或遗忘密码后用户一定能通过申诉找回该帐号。",
              "4.5 用户注册的账号，如长期不使用，德纵科技有权回收账号，由此带来的包括并不限于用户通信中断、用户资料、邮件和游戏道具丢失等损失由用户自行承担。",
            ]
          },
          {
            title: '五、【内容所有权】',
            paragraphs: [
              "5.1 德纵科技提供的网络服务内容包括但不限于：资讯、软件、多媒体、网络媒体、互联网增值、互动娱乐、电子商务和广告等。所有这些内容受版权、商标和其它财产所有权法律的保护。",
              "5.2 用户只有在获得德纵科技或其他相关权利人的授权之后才能使用这些内容，而不能擅自复制、再造这些内容、或创造与内容有关的派生产品。",
              "5.3 除另有特别声明外，德纵科技提供本服务时所依托软件的著作权、专利权及其他知识产权均归德纵科技所有。",
            ]
          },
          {
            title: '六、【用户个人信息保护】',
            paragraphs: [
              "6.1 用户同意个人隐私信息是指那些能够对用户进行个人辨识或涉及个人通信的信息，包括下列信息：用户的姓名，身份证号，手机号码，IP地址，电子邮件地址相关信息。非个人隐私信息是指用户对本软件的操作状态以及使用习惯等一些明确且客观反映在德纵科技服务器端的基本记录信息和其他一切个人隐私信息范围外的普通信息。",
              "6.2 保护用户个人信息是德纵科技的一项基本原则，德纵科技将按照本协议及《隐私政策》的规定收集、使用、储存和分享您的个人信息。并采取本公司认为必要的安全技术和程序建立完善的管理制度来保护您的个人信息，以免遭受未经授权的访问、使用或披露。德纵科技将会采取合理的措施保护用户的个人隐私信息，除法律或有法律赋予权限的政府部门要求或用户同意等原因外，德纵科技未经用户同意不向除合作单位以外的第三方公开、透露用户个人隐私信息。但是用户在注册时选择或同意，或用户与德纵科技就用户个人隐私信息公开或使用另有约定的除外，同时用户应自行承担因此可能产生的任何风险，德纵科技对此不予负责。 同时为了运营和改善德纵科技的技术和服务，我们将可能会自己收集使用或向第三方提供用户的非个人隐私信息，这将有助于向用户提供更好的用户体验和提高我们的服务质量。",
              "6.3 德纵科技不会将您的个人信息转移或披露给任何非关联的第三方，除非：",
              "（1）事先获得用户的明确授权；",
              "（2）法律或有法律赋予权限的政府部门要求；",
              "（3）为完成合并、分立、收购或资产转让而转移；",
              "（4）为提供您要求的服务所必需；",
              "（5）执行软件验证服务；",
              "（6）执行软件升级服务；",
              "（7）提高用户的使用安全性并提供客户支持；",
              "（8）因用户使用所处场所WiFi特定功能或因用户要求德纵科技提供特定服务时，德纵科技则需要把用户的信息提供给与此相关联的第三方；",
              "（9）将各种非个人隐私数据用于商业目的，包括但不限于向第三方提供增值服务、广告、定位广告、营销、联合注册其它服务、促销或其它任何活动（统称为“商业活动”）；",
              "（10）执行德纵科技的《隐私政策》；",
              "（11）其他有利于用户和德纵科技利益的。",
              "6.4 若您是18周岁以下的未成年人，在使用德纵科技的服务前，应事先取得您家长或法定监护人（以下简称\"监护人\"）的同意。",
            ]
          },
          {
            title: '七、【广告】',
            paragraphs: [
              "7.1 用户同意德纵科技可以在提供服务的过程中自行或由第三方广告商向用户发送广告、推广或宣传信息（包括商业与非商业信息），其方式和范围可不经向用户特别通知而变更。",
              "7.2 德纵科技可能为用户提供（以付费的方式）选择关闭广告信息的功能，但任何时候您都不得以本协议未明确约定或德纵科技未书面许可的方式屏蔽、过滤广告信息。",
              "7.3 德纵科技依照法律的规定对广告商履行相关义务，用户应当自行判断广告信息的真实性并为自己的判断行为负责，除法律明确规定外，用户因依该广告信息进行的交易或前述广告商提供的内容而遭受的损失或损害，德纵科技不承担责任。",
              "7.4 用户对德纵科技提供服务中出现的广告信息，应审慎判断其真实性和可靠性，除法律明确规定外，用户应对依该广告信息进行的交易负责。",
            ]
          },
          {
            title: '八、【不可抗力及其他免责事由】',
            paragraphs: [
              "8.1 用户理解并同意，在使用本服务的过程中，可能会遇到不可抗力等风险因素，使本服务发生中断。不可抗力是指不能预见、不能克服并不能避免且对一方或双方造成重大影响的客观事件，包括但不限于自然灾害如洪水、地震、瘟疫流行和风暴等以及社会事件如战争、动乱、政府行为等。出现上述情况时，德纵科技将努力与相关单位配合，及时进行修复，但是由此给您造成的损失德纵科技在法律允许的范围内免责。",
              "8.2 在法律允许的范围内，德纵科技对以下情形导致的服务中断或受阻不承担责任：",
              "（1）受到计算机病毒、木马或其他恶意程序、黑客攻击的破坏；",
              "（2）用户或德纵科技的电脑软件、系统、硬件和通信线路出现故障；",
              "（3）用户操作不当；",
              "（4）用户通过非德纵科技授权的方式使用本服务；",
              "（5）其他德纵科技无法控制或合理预见的情形。",
              "8.3 用户理解并同意，在使用本服务的过程中，可能会遇到网络信息或其他用户行为带来的风险，德纵科技不对任何信息的真实性、适用性、合法性承担责任，也不对因侵权行为给您造成的损害负责。这些风险包括但不限于：",
              "（1）来自他人匿名或冒名的含有威胁、诽谤、令人反感或非法内容的信息；",
              "（2）因使用本协议项下的服务，遭受他人误导、欺骗或其他导致或可能导致的任何心理、生理上的伤害以及经济上的损失；",
              "（3）其他因网络信息或用户行为引起的风险。",
              "8.4 您理解并同意，本服务并非为某些特定目的而设计，包括但不限于军事用途、医疗设施、交通通讯等重要领域以及商业领域。如果因为软件或服务的原因导致上述操作失败而带来的人员伤亡、财产损失和环境破坏等，德纵科技不承担法律责任。",
              "8.5 在任何情况下，您不应轻信借款、索要密码或其他涉及财产的网络信息。涉及财产操作的，请一定先核实对方身份，并请经常留意警方有关防范诈骗犯罪的提示。",
              "8.6 德纵科技不保证为向用户提供便利而设置的外部链接的准确性和完整性，同时，对于该等外部链接指向的不由德纵科技实际控制的任何网页上的内容，德纵科技不承担任何责任。",
            ]
          },
          {
            title: '九、【服务变更、中断或终止】',
            paragraphs: [
              "9.1 您理解并同意，德纵科技的服务是按照现有技术和条件所能达到的现状提供的。德纵科技会尽最大努力向您提供服务，确保服务的连贯性和安全性；但德纵科技不能随时预见和防范法律、技术以及其他风险，包括但不限于不可抗力、病毒、木马、黑客攻击、系统不稳定、第三方服务瑕疵、政府行为等原因可能导致的服务中断、数据丢失以及其他的损失和风险。",
              "9.2 德纵科技可能会对服务内容进行变更，也可能会中断、中止或终止服务。",
              "9.3 如因系统维护或升级的需要而需暂停网络服务，德纵科技将采取合理的方式事先进行通告。",
              "9.4 如发生下列任何一种情形，德纵科技有权不经通知而中断或终止向您提供服务：",
              "（1）根据法律规定用户应提交真实信息，而您提供的个人资料不真实、或与注册时信息不一致又未能提供合理证明；",
              "（2）用户违反相关法律法规或本协议的约定；",
              "（3）按照法律规定或主管部门的要求；",
              "（4）出于安全的原因或其他必要的情形。",
              "9.5 除前款所述情形外，德纵科技同时保留在不事先通知用户的情况下随时中断或终止部分或全部网络服务的权利，对于所有服务的中断或终止而造成的任何损失，德纵科技无需对用户或任何第三方承担任何责任。",
            ]
          },
          {
            title: '十、【违约赔偿】',
            paragraphs: [
              "10.1 用户同意保障和维护德纵科技及其他用户的利益，如因用户违反有关法律、法规或本协议项下的任何条款而给德纵科技或任何第三人造成损失，用户同意承担由此造成的损害赔偿责任。",
            ]
          },
          {
            title: '十一、【协议修改】',
            paragraphs: [
              "11.1 德纵科技将有权随时修改本协议的有关条款，一旦本协议的内容发生变动，德纵科技将会通过适当方式向用户提示修改内容。",
              "11.2 如果不同意德纵科技对本协议相关条款所做的修改，用户有权停止使用网络服务。如果用户继续使用网络服务，则视为用户接受德纵科技对本协议相关条款所做的修改。",
            ]
          },
          {
            title: '十二、【法律管辖】',
            paragraphs: [
              "12.1 本协议的订立、执行和解释及争议的解决均应适用中国法律。",
              "12.2 如双方就本协议内容或其执行发生任何争议，双方应尽量友好协商解决；协商不成时，任何一方均可向被告所在地有管辖权的人民法院提起诉讼。",
            ]
          },
          {
            title: '十三、【未成年人使用条款】',
            paragraphs: [
              "13.1 若用户未满18周岁，则为未成年人，应在监护人监护、指导下阅读本协议和使用本服务。",
              "13.2 未成年人用户涉世未深，容易被网络虚象迷惑，且好奇心强，遇事缺乏随机应变的处理能力，很容易被别有用心的人利用而又缺乏自我保护能力。因此，未成年人用户在使用本服务时应注意以下事项，提高安全意识，加强自我保护：",
              "（1）认清网络世界与现实世界的区别，避免沉迷于网络，影响日常的学习生活；",
              "（2）填写个人资料时，加强个人保护意识，以免不良分子对个人生活造成骚扰；",
              "（3）在监护人或老师的指导下，学习正确使用网络；",
              "（4）避免陌生网友随意会面或参与联谊活动，以免不法分子有机可乘，危及自身安全。",
              "13.3 监护人、学校均应对未成年人使用本服务时多做引导。特别是家长应关心子女的成长，注意与子女的沟通，指导子女上网应该注意的安全问题，防患于未然。",
            ]
          },
          {
            title: '十四. 【其他条款 】',
            paragraphs: [
              "14.1 本协议及隐私政策共同构成了本软件及其支持服务的完整协议。",
              "14.2 本协议及隐私政策所定的任何条款的部分或全部无效，不影响其它条款的效力。",
              "14.3 如来云WiFi的运营单位是安徽德纵信息技术有限公司，并独立承担法律责任。当前您所处的场所及其附属机构均不会对如来云WiFi 及APP的运作，或其内容的准确性、周全性或完整性做出任何明示或暗示的表述或保证，或承担相关法律责任。",
              "14.4 本协议及隐私政策的所有标题仅仅是为了阅读方便，本身并无实际含义。",
              "14.5德纵科技客户服务热线：+86-551-85 200200，如有任何问题，欢迎与我们联系。",
            ]
          },
        ],
        privacy: [
          {
            title: '一、【信息的收集和使用】',
            paragraphs: [
              "为提供如来云WiFi联网服务，以及进一步优化该等服务，我们会收集您的相关信息，这些信息包括",
              "（1）您在注册账户或使用服务时，根据服务需要和国家法律规定要求披露的个人信息，例如姓名、电话号码等；",
              "（2）您在使用连接服务时，系统自动接收并记录的信息，比如IP地址、浏览器类型、使用语言、访问日期和时间、软硬件特征信息、曾使用的移动应用和其他软件的信息等；",
              "（3）您在使用连接服务时，系统可能会读取您的移动设备属性及其存储信息，比如您使用设备的品牌及型号、识别码、所在国家或地区，位置信息等。",
              "这些信息将用于下列用途：",
              "（1）向您提供服务；",
              "（2）在我们提供服务时，用于身份验证、客户服务、安全防范、存档和备份；",
              "（3）帮助我们设计新服务，改善现有服务；",
              "（4）使我们更加了解您如何接入和使用我们的服务，从而针对性地回应您的个性化需求，例如语言设定、位置设定、个性化的帮助服务和指示等；",
              "（5）向您提供与您更加相关的广告以替代普遍投放的广告；",
              "（6）评估我们服务中的广告和其他促销及推广活动的效果，并加以改善；",
              "（7）软件认证或升级；",
              "（8）邀请您参与有关我们产品和服务的调查。",
              "为了让您有更好的体验、改善我们的服务或您同意的其他用途，在符合相关法律法规的前提下，我们可能将通过某一项服务所收集的信息，以汇集信息或者个性化的方式，用于我们的其他服务。",
            ]
          },
          {
            title: '二、【信息的保护和分享】',
            paragraphs: [
              "在未经您同意之前，德纵科技不会向任何第三方提供、出售、出租、分享和交易您的个人资料，但以下情形除外：",
              "（1）为遵守法律法规之要求，包括在国家有关机关或其授权的单位查询时，向其提供有关资料；",
              "（2）为免除您在生命、身体或财产方面之急迫危险，或为防止他人权益之重大危害；",
              "（3）为保护德纵科技及其关联公司、或其用户的权利及财产。",
              "您理解并同意，德纵科技可能会与与公众、管理公司、合作伙伴（例如运营商、发布商、广告客户）分享非个人身份识别信息。例如，德纵科技及其关联公司可能会与公众分享某些信息，以展示如来云WiFi产品或服务的整体使用趋势和使用情况，比如某一时间的接入数据。在不透露您个人信息的前提下，比如，经过处理无法识别特定个人且不能复原的情况下，德纵科技或其关联公司有权对用户数据库进行分析并进行商业上的利用。\n" +
              "我们如何储存和保护您的信息",
              "我们仅在本《隐私政策》所述目的所必需的期间和法律法规要求的时限内保留您的个人信息。",
              "我们使用我们认为必要的安全技术和程序，以防信息的丢失、不当使用、未经授权阅览或披露、被篡改或损坏。您的个人信息存放在有密码控制的服务器中，访问均是受到限制的。但请您理解，由于技术的限制以及可能存在的各种恶意手段，在互联网行业，即便竭尽所能加强安全措施，也不可能始终保证信息百分之百的安全。您需要了解，您接入我们的服务所用的系统和通讯网络，有可能因我们可控范围外的因素而出现问题。\n" +
              "有关共享信息的提示",
              "通过我们及第三方的服务，可让您不仅与自己的社交网络，也与使用该服务的所有用户公开分享您的相关信息，例如，您上传或发布的信息（包括您公开的个人信息、您建立的名单）、您对其他人上传或发布的信息作出的回应，以及包括与这些信息有关的位置数据和日志信息。其他用户也有可能分享与您有关的信息（包括位置数据和日志信息）。特别是，社交媒体服务，是专为使您与世界各地的用户共享信息而设计，您可以使共享信息实时、广泛地传递。只要您不删除共享信息，有关信息会一直留存在公共领域；即使您删除共享信息，有关信息仍可能由其他用户或不受我们控制的非关联第三方独立地缓存、复制或储存，或由其他用户或该等第三方在公共领域保存。\n" +
              "请记住，无论何时您披露个人信息，此种信息都可能被他人收集及使用，因此造成您的个人信息泄露，我们不承担责任，如果您将个人信息公布在上述渠道，您就有可能造成个人信息泄露。因此，我们提醒并请您慎重考虑是否有必要在上述渠道公开您的个人信息。\n" +
              "因此，请您认真考虑上传、发布和交流的信息内容。",
              "有关个人敏感信息的提示",
              "某些个人信息因其特殊性可能被认为是个人敏感信息，例如您的种族、宗教、个人健康和医疗信息等。相比其他个人信息，敏感个人信息受到更加严格的保护。请注意，您在使用我们的服务时所提供、上传或发布的内容和信息（例如有关您社交活动的照片等信息），可能会泄露您的敏感个人信息。建议您不要主动向网站提供个人敏感信息，否则不保证被意外收集的可能性\n" +
              "广告服务",
              "我们可能使用您的相关信息，向您提供与您更加相关的广告。我们也可能使用您的信息，通过我们的服务或其他合理的方式向您发送营销信息，提供或推广我们或第三方的商品和服务。\n" +
              "我们可能向您发送的信息",
              "信息推送",
              "您在使用我们的服务时，我们可能使用您的信息向您的设备发送新闻或推送通知。如您不希望收到这些信息，可以按照我们的相关提示，在设备上选择取消或关闭。",
              "与服务有关的公告我们可能在必要时（例如因系统维护而暂停某一项服务时）向您发出与服务有关的公告。您可能无法取消这些与服务有关、性质不属于推广的公告。\n" +
              "隐私政策的适用例外",
              "我们的服务可能包括或链接至第三方提供的社交媒体或其他服务（包括网站）。该等第三方社交媒体或其他服务可能由相关的第三方运营。您使用该等第三方的社交媒体服务或其他服务（包括您向该等第三方提供的任何个人信息），须受该第三方的服务条款及隐私政策（而非《通用服务条款》或本《隐私政策》）约束，您需要仔细阅读其条款。本《隐私政策》仅适用于我们所收集的信息，并不适用于任何第三方提供的服务或第三方的信息使用规则，我们对任何第三方使用由您提供的信息不承担任何责任。\n" +
              "未成年人使用我们的服务",
              "我们鼓励父母或监护人指导未满十八岁的未成年人使用我们的服务。我们建议未成年人鼓励他们的父母或监护人阅读本《隐私政策》，并建议未成年人在提交的个人信息之前寻求父母或监护人的同意和指导。\n" +
              "隐私政策的适用范围",
              "除某些特定服务外，我们所有的服务均适用本《隐私政策》。这些特定服务将适用特定的隐私政策。针对某些特定服务的特定隐私政策，将更具体地说明我们在该等服务中如何使用您的信息。该特定服务的隐私政策构成本《隐私政策》的一部分。如相关特定服务的隐私政策与本《隐私政策》有不一致之处，适用该特定服务的隐私政策。\n" +
              "请您注意，本《隐私政策》不适用于以下情况：",
              "通过我们的服务而接入的第三方服务（包括任何第三方网站）收集的信息；通过在我们服务中进行广告服务的其他公司或机构所收集的信息。\n" +
              "变更",
              "我们可能适时修订本《隐私政策》的条款，该等修订构成本《隐私政策》的一部分。随着服务范围的扩大和调整，我们可能随时更新我们的隐私政策，如果我们对其作了任何重大变更，我们会在该变等变更生效之前，通过网页公布的方式通知您。我们鼓励您定期地查阅本网页上关于我们隐私实践的信息。\n" +
              "如对本隐私政策或我们的服务有任何的意见或建议，欢迎您将有关信息发送至 （ server@rulaiyun.net ） 邮箱 我们将在正常工作时间内对信息进行查收、处理及反馈。",
            ]
          },
          {
            title: '',
            paragraphs: [
              "",
              "",
              "",
              ""
            ]
          },
          {
            title: '',
            paragraphs: [
              "",
              "",
              "",
              ""
            ]
          },

          {
            title: '',
            paragraphs: [
              "",
              "",
              "",
              ""
            ]
          },
          {
            title: '',
            paragraphs: [
              "",
              "",
              "",
              ""
            ]
          },
          {
            title: '',
            paragraphs: [
              "",
              "",
              "",
              ""
            ]
          },
          {
            title: '',
            paragraphs: [
              "",
              "",
              "",
              ""
            ]
          },
          {
            title: '',
            paragraphs: [
              "",
              "",
              "",
              ""
            ]
          },
        ]
      }
    },
    methods: {
      back: function () {
        history.go(-1);
      }
    }
  }
</script>

<style scoped>
  .box, h5, p {
    font-size: 0.12rem;
    text-align: left;

  }

  p {
    color: #6b6b6b;
    text-indent: 0.24rem;
  }

  h5 {
    color: #222222;
  }

  .header {
    height: 0.5rem;
    line-height: 0.5rem;
    background-color: rgba(37, 44, 53, 1);
  }

  .agreement-tip {
    margin-top: 20px;
    margin-bottom: 10px;
  }

  .mint-tab-container-item {
    padding: 0 0.24rem;
    box-sizing: border-box;
    line-height: 0.24rem;
  }
</style>
